Revit 2024 API
ImportIFCOptions Properties
The ImportIFCOptions type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LinkProcessor
 Specifies the engine to use while doing a Link IFC operation.
See Also
ImportIFCOptions Class
Autodesk.Revit.DB Namespace